Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetLocalCoordinateSystem(System.Double)
Gets the local coordinate system (LCS) reflects analytical model orientation at the specified parameter value along a curve.
parameter:
The parameter value along a curve that should be in the range [0, 1], where 0 represents start and 1 represents end of the element.
Returns:
Transformation matrix.
x - longitudinal axis, y - transversal, section - horizontal, strong axis, z - transversal, section - vertical, weak axis, origin - base point of LCS.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The parameter is out of range from 0 to 1.
Since:
2015